experimental/glm52_b300_fixed_seq/results/c2-four-frontier-megamoe-refresh-20260921/regression-reference/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc16/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 160 --max-concurrency 16 --request-rate inf --ignore-eos --save-result --num-warmups 32 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc16 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.gm46uN ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.gm46uN -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 160 --max-concurrency 16 --request-rate inf --ignore-eos --save-result --num-warmups 32 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc16 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=16, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=160, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc16', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=32)
Generating 160 prompts using 8 worker processes...
Prompt generation completed in 3.6s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=821   max=1024  mean=925.42   avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=916.68  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 32 requests...
100%|██████████| 32/32 [00:21<00:00,  1.47it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
  0%|          | 0/160 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 160/160 [01:56<00:00,  1.37it/s]
============ Serving Benchmark Result ============
Successful requests:                     160       
Benchmark duration (s):                  116.38    
Total input tokens:                      148067    
Total generated tokens:                  146669    
Request throughput (req/s):              1.37      
Output token throughput (tok/s):         1260.26   
Total Token throughput (tok/s):          2532.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          638.04    
Median TTFT (ms):                        390.39    
P90 TTFT (ms):                           1540.06   
P99 TTFT (ms):                           2416.83   
P99.9 TTFT (ms):                         2470.50   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.65     
Median TPOT (ms):                        11.71     
P90 TPOT (ms):                           13.20     
P99 TPOT (ms):                           14.06     
P99.9 TPOT (ms):                         14.30     
---------------Inter-token Latency----------------
Mean ITL (ms):                           942.55    
Median ITL (ms):                         678.25    
P90 ITL (ms):                            1969.23   
P99 ITL (ms):                            3899.35   
P99.9 ITL (ms):                          6163.37   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11300.67  
Median E2EL (ms):                        11414.01  
P90 E2EL (ms):                           13260.32  
P99 E2EL (ms):                           14439.28  
P99.9 E2EL (ms):                         14881.73  
==================================================
+ set +x